# 2. Packages
---

In diesen Skript bearbeiten wir die Grundlagen von Packages.
Python bietet ein breites und umfangreiches Ökosystem an Packages
Sei es von 
- Webframeworks (`Django`), 
- Spieleentwicklung (`Pygame`), 
- Big Data (`Spark`), 
- Daten analyse (`Seaborn`, `plotly`, `Matplotlib`)
- Machine Learning (`Skit-learn`, `Statsmodels`), 
- Deep Learning (`Tensorflow / Keras`) und viel mehr.
---

Wenn wir in einem Jupyter Nootebook arbeiten nutzen wir:

`%pip install dein_package`

In einer `.py` Datei wird die Eingabe in dem Terminal getätig und zwar wie folgt:
`pip install dein_package`

<img src="Pic_for_expla/install_package_terminal.png" alt="Terminal package install" width="700"/>

Anhand eines beispieles indemfall das Packages Pandas *`verdeutlichen`*:
um das Paket zu verwenden nutzen wir sowohl in einem `.ipynb` und `.py` 
`import pandas as pd`

Mit `import` importieren wie das Package somit könne wir das Package nutzen.

**ACHTUNG:**

Wir referenzieren das Package statt mit `pandas` nun mit `pd` da wir sagen `as pd`.
Das bedeutet das wenn wir die pandas Funktion nutzen möchten schreiben wir statt `pandas` nur noch `pd`.

Wie finden wir heraus welche Funktion nun Pandas hat ? 

Jedes große Package wie Pandas, Streamlit und viele mehr haben eine Offiziele Dokumentation.
Die offiziele Dokumentation von Pandas findest du hier: https://pandas.pydata.org/docs/index.html 

Dabei wird erklärt 
- welche Funktion es gibt 
- welche Parameter mitgeben werden können 


zugleich werden weiter unten manchmal beispiele mitgegeben wie der Code anzuwenden ist.

In [23]:
# Wie besproche müssen wir Pandas zunächst installieren:
%pip install pandas

Requirement already satisfied: pandas in /Users/riccardo/Desktop/Github/Python-Crashkurs/venv/lib/python3.10/site-packages (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/riccardo/Desktop/Github/Python-Crashkurs/venv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/riccardo/Desktop/Github/Python-Crashkurs/venv/lib/python3.10/site-packages (from pandas) (2024.2)
Requirement already satisfied: numpy>=1.22.4 in /Users/riccardo/Desktop/Github/Python-Crashkurs/venv/lib/python3.10/site-packages (from pandas) (2.1.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/riccardo/Desktop/Github/Python-Crashkurs/venv/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/riccardo/Desktop/Github/Python-Crashkurs/venv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip available: 22.3.1 -> 24.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [24]:
# Importierung der Funktion
import pandas as pd

Wir nutzen als erste Funktion um Daten einzulesen:

- [pd.read_csv(filepath_or_buffer="Deine_Datei.csv", sep=",")](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html)

In [25]:
df = pd.read_csv("https://raw.githubusercontent.com/RiccardoDAndrea/Python-Crashkurs/refs/heads/main/Data/titantic.csv")

In [26]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Um eine Spalte aus einem DataFrame zu entfernen, können wir die Funktion df.drop() wie folgt verwenden:

- `df.drop(columns=["Spalte"], inplace=True)` entfernt die Spalte dauerhaft aus dem DataFrame, da die Änderung direkt im ursprünglichen DataFrame durchgeführt wird.

- `df = df.drop(columns=["Spalte"])` wird verwendet, wenn der Parameter inplace nicht angegeben ist. In diesem Fall muss das Ergebnis entweder in der gleichen oder einer neuen Variablen gespeichert werden. Andernfalls wird die Änderung nur temporär vorgenommen und hat keinen Einfluss auf den DataFrame im weiteren Verlauf des Codes.

In [27]:
### Aufgabe 
df.drop(columns=["Unnamed: 0"], inplace = True)

In [28]:
# überprüfe ob die Spalte wirklich entfernt wurde
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

`df.info()` gibt uns eine gesamte Übersicht über die Datentypen für jede Spalte

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Wir sehen das folgende Spalten `objects` sind:
- Name
- Sex
- Ticket
- Cabin
- Embarked

Betrachte die Spalten und entscheide welche Datentypen du verwendets.

In [30]:
df["Name"] = df["Name"].astype("string")
df["Sex"] = df["Sex"].astype("category")
# mache weiter mit Ticket, Cabin und Embarked

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    string
 4   Sex          891 non-null    category
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: category(1), float64(2), int64(5), object(3), string(1)
memory usage: 77.7+ KB

Der nachfolgende Code

In [32]:
df["Ticket"].unique().shape  # folgender Code gibt dir an welche Länder in der Spalte "Tickets" vorkommen

(681,)

Filterung der Daten:
---
Es gibt unzähliche Methoden um Daten zu filtern. 
Einer der möglichkeiten werden wir nun besprechen und üben.

In [ ]:
# Der folgende Datensatz enthält nur Daten über die überlebende
Survived_df = df[df["Survived"] == 1]

# Der folgende Datensatz enthält nur Daten über die verstorbenen
Perished_df = df[df["Survived"] == 0]



Survived_df.head()

Ein dataframe nur mit den Passagieren die die `1. Klasse` gebucht haben

In [ ]:
first_class_df = df[df["Pclass"] == ]

Ein dataframe nur mit den Passagieren die die `2. Klasse` gebucht haben

In [ ]:
second_class_df = df[df[""] == ]

Ein dataframe nur mit den Passagieren die die `3. Klasse` gebucht haben

In [ ]:
thrid_class_df =

Daten filtern mit zwei Bedigungen oder mehr Bedigungen

In [39]:
maleSurvived_df = df[(df["Sex"] == "male") & 
                    (df["Survived"] == 1)].round(2)


maleSurvived_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.00,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.00,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.50,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.23,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.50,C52,S

Filter nun die Daten nach zwei Bedigungen
- Alle personen die älter oder gleich 25 sind
- sowie die die 1. Klasse gebucht haben.